<?php

namespace App\Filament\Tabs\Race;

use Filament\Forms\Components\Select;
use Filament\Forms\Components\Tabs\Tab;
use Filament\Forms\Components\TextInput;

class RolePlayTab
{
    public static function make()
    {
        return Tab::make('Отыгрыш')
            ->columns(2)
            ->schema([
                Select::make('size')
                    ->label('Размер')
                    ->options([
                        'Маленький' => 'Маленький',
                        'Средний' => 'Средний',
                        'Большой' => 'Большой',
                    ])
                    ->default('Средний')
                    ->required(),
                TextInput::make('height')
                    ->label('Рост')
                    ->numeric()
                    ->minValue(1)
                    ->required(),
                TextInput::make('weight')
                    ->label('Вес')
                    ->numeric()
                    ->minValue(1)
                    ->required(),
                Select::make('lang')
                    ->label('Доступные языки')
                    ->options([
                        'Общий язык' => 'Общий язык',
                        'Дварфский язык' => 'Дварфский язык',
                        'Эльфийский язык' => 'Эльфийский язык',
                        'Гномий язык' => 'Гномий язык',
                        'Орчий язык' => 'Орчий язык',
                        'Халдейский язык' => 'Халдейский язык',
                        'Гоблинский язык' => 'Гоблинский язык',
                        'Полуросликов язык' => 'Полуросликов язык',
                        'Гигантский язык' => 'Гигантский язык',
                        'Драконий язык' => 'Драконий язык',
                        'Глубинная речь' => 'Глубинная речь',
                        'Небесный язык' => 'Небесный язык',
                        'Инфернальный язык' => 'Инфернальный язык',
                        'Сильван язык' => 'Сильван язык',
                        'Друидский язык' => 'Друидский язык',
                        'Акван язык' => 'Акван язык',
                        'Игнан язык' => 'Игнан язык',
                        'Терран язык' => 'Терран язык',
                        'Ауран язык' => 'Ауран язык',
                        'Бездны язык' => 'Бездны язык',
                        'Целистий язык' => 'Целистий язык',
                    ])
                    ->multiple()
                    ->searchable()
                    ->required(),
                Select::make('ideology')
                    ->label('Мировоззрения')
                    ->options([
                        "Законно-доброе"=>"Законно-доброе",
                        "Нейтрально-доброе"=>"Нейтрально-доброе",
                        "Хаотично-доброе"=>"Хаотично-доброе",
                        "Законно-нейтральное"=>"Законно-нейтральное",
                        "Нейтральное"=>"Нейтральное",
                        "Хаотично-нейтральное"=>"Хаотично-нейтральное",
                        "Законно-злое"=>"Законно-злое",
                        "Нейтрально-злое"=>"Нейтрально-злое",
                        "Хаотично-злое"=>"Хаотично-злое"
                    ])
                    ->searchable()
                    ->multiple()
                    ->required(),
            ]);
    }
}
